app/controllers/products_controller.rb

INSERT INTO "products" ("created_at", "description", "maker", "name", "registered_at", "stock", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "description" = ?, "updated_at" = ? WHERE "products"."id" = 1  [["description", "una prueba modificada"], ["updated_at", Wed, 26 Feb 2014 18:05:48 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)